tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1716_tdd.h
#define LC4D4S0                       1649
#define LC4D4S                        1650
#define CLC4SEL3_D4S0                 1651
#define CLC4SEL3_D4S                  1652
#define LC4D4S1                       1653
#define CLC4SEL3_D4S1                 1654
#define LC4D4S2                       1655
#define CLC4SEL3_D4S2                 1656
#define LC4D4S3                       1657
#define CLC4SEL3_D4S3                 1658
#define LC4D4S4                       1659
#define CLC4SEL3_D4S4                 1660
#define CLC4GLS0                      1661
#define CLC4GLS0_D1N                  1662
#define LC4G1D1N                      1663
#define CLC4GLS0_D1T                  1664
#define LC4G1D1T                      1665
#define CLC4GLS0_D2N                  1666
#define LC4G1D2N                      1667
#define CLC4GLS0_D2T                  1668
#define LC4G1D2T                      1669
#define CLC4GLS0_D3N                  1670
#define LC4G1D3N                      1671
#define CLC4GLS0_D3T                  1672
#define LC4G1D3T                      1673
#define CLC4GLS0_D4N                  1674
#define LC4G1D4N                      1675
#define CLC4GLS0_D4T                  1676
#define LC4G1D4T                      1677
#define CLC4GLS1                      1678
#define CLC4GLS1_D1N                  1679
#define LC4G2D1N                      1680
#define CLC4GLS1_D1T                  1681
#define LC4G2D1T                      1682
#define LC4G2D2N                      1683
#define CLC4GLS1_D2N                  1684
#define LC4G2D2T                      1685
#define CLC4GLS1_D2T                  1686
#define CLC4GLS1_D3N                  1687
#define LC4G2D3N                      1688
#define LC4G2D3T                      1689
#define CLC4GLS1_D3T                  1690
#define CLC4GLS1_D4N                  1691
#define LC4G2D4N                      1692
#define CLC4GLS1_D4T                  1693
#define LC4G2D4T                      1694
#define CLC4GLS2                      1695
#define CLC4GLS2_D1N                  1696
#define LC4G3D1N                      1697
#define CLC4GLS2_D1T                  1698
#define LC4G3D1T                      1699
#define LC4G3D2N                      1700
#define CLC4GLS2_D2N                  1701
#define LC4G3D2T                      1702
#define CLC4GLS2_D2T                  1703
#define CLC4GLS2_D3N                  1704
#define LC4G3D3N                      1705
#define CLC4GLS2_D3T                  1706
#define LC4G3D3T                      1707
#define LC4G3D4N                      1708
#define CLC4GLS2_D4N                  1709
#define LC4G3D4T                      1710
#define CLC4GLS2_D4T                  1711
#define CLC4GLS3                      1712
#define CLC4GLS3_G4D1N                1713
#define LC4G4D1N                      1714
#define LC4G4D1T                      1715
#define CLC4GLS3_G4D1T                1716
#define LC4G4D2N                      1717
#define CLC4GLS3_G4D2N                1718
#define LC4G4D2T                      1719
#define CLC4GLS3_G4D2T                1720
#define CLC4GLS3_G4D3N                1721
#define LC4G4D3N                      1722
#define CLC4GLS3_G4D3T                1723
#define LC4G4D3T                      1724
#define LC4G4D4N                      1725
#define CLC4GLS3_G4D4N                1726
#define LC4G4D4T                      1727
#define CLC4GLS3_G4D4T                1728
#define STATUS_SHAD                   1729
#define C_SHAD                        1730
#define DC_SHAD                       1731
#define Z_SHAD                        1732
#define WREG_SHAD                     1733
#define BSR_SHAD                      1734
#define PCLATH_SHAD                   1735
#define FSR0L_SHAD                    1736
#define FSR0H_SHAD                    1737
#define FSR1L_SHAD                    1738
#define FSR1H_SHAD                    1739
#define STKPTR                        1740
#define TOSL                          1741
#define TOSH                          1742

#endif // _PIC16F1716_H_
